src/ex_Tabakon/Documents/ОплатаОтПокупателяПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОплатаОтПокупателяПлатежнойКартой</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробиватьЧекиПоКассеККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СменаЗакрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствВКассуККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыдачаДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ОплатаОтПокупателяПлатежнойКартой/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВызватьОплатитьКартой()Экспорт
	ТБК_ВозвратТоваровОтПокупателяКартой = Истина; // Андрей
	ОплатитьКартой(Неопределено)
КонецПроцедуры

// Толстоухов 23.12.2025 ROZ-8 ++
// При осуществлении возврата не заполнять двенадцать нулей
// и нажимать "Ок"
&НаКлиенте
&Вместо("ОплатитьКартой")
Процедура ТБКОплатитьКартой(Команда)
	
	Перем ПараметрыКассыККМ, ПараметрыЭТ;
	
	
	Если ТБК_ВозвратТоваровОтПокупателяКартой = Истина Тогда
		
		Если НЕ ПроверкаВозможностиРаботыСКартой(ПараметрыКассыККМ, ПараметрыЭТ) Тогда
			Возврат;
		КонецЕсли;
		
		//// &ЗамерПроизводительности
		//ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		//Истина, "Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ.Открытие");
		//
		//
		//// Предварительно авторизуем операцию.
		//ПараметрыФормы = Новый Структура("Сумма, ПределСуммы", Объект.СуммаДокумента, Объект.СуммаДокумента);
		//ПараметрыФормы.Вставить("ЗапретРедактированияСуммы", Истина);
		//Если ПараметрыЭТ.ИспользоватьБезПодключенияОборудования Тогда
		//	ПараметрыФормы.Вставить("ПоказыватьНомерКарты", Истина);
		//КонецЕсли;
		
		ПараметрДействия = Новый Структура;
		ПараметрДействия.Вставить("ПараметрыКассыККМ", ПараметрыКассыККМ);
		ПараметрДействия.Вставить("ПараметрыЭТ", ПараметрыЭТ);
		ПараметрДействия.Вставить("СуммаОперации", 0);
		ПараметрДействия.Вставить("НомерКарты", "");
		ПараметрДействия.Вставить("НомерСсылкиОперации", "");
		ПараметрДействия.Вставить("НомерЧекаЭТ", 0);
		ПараметрДействия.Вставить("НомерЧекаККМ", Объект.Номер);
		ПараметрДействия.Вставить("СтрокаСлипЧека", "");
		
		Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента") Тогда
			ПараметрДействия.Вставить("ТипТранзакции", "AuthorizeSales");
		Иначе
			ПараметрДействия.Вставить("ТипТранзакции", "AuthorizeRefund");
			//ПараметрыФормы.Вставить("УказатьДополнительныеДанные", Истина);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрДействия", ПараметрДействия);
		
		СтруктураВозврата = Новый Структура();
		СтруктураВозврата.Вставить("Сумма"         , Объект.СуммаДокумента);
		СтруктураВозврата.Вставить("ДанныеКарты"   , "");
		СтруктураВозврата.Вставить("СсылочныйНомер", "000000000000");
		СтруктураВозврата.Вставить("ТипКарты"      , 0);
		СтруктураВозврата.Вставить("НомерКарты"    , "");
		СтруктураВозврата.Вставить("НомерЧека"     , "");
		СтруктураВозврата.Вставить("НомерЧекаЭТ"   , "");
		
		
		ОповещениеОткрытьФормуАвторизацииЭТ(СтруктураВозврата, ДополнительныеПараметры);
		
	Иначе
		
		ПродолжитьВызов(Команда);
		
	КонецЕсли;	
	
КонецПроцедуры
